Библиотека/src/InformationRegisters/КаталогКниг/КаталогКниг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КаталогКниг</name>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Автор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Издательство</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ISBN</name>
    <comment>Строка в формате с дефисами</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ISBNЧисло</name>
    <comment>Строка без дефисов для поиска</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГодИздания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СсылкаНаСайт</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СсылкаНаКартинку</name>
    <comment>Ссылка на картинку</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторКниги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Библиотека/src/CommonModules/КаталогКнигСервер/Module.bsl
// Скачивает архив книг с сайта OZON, разбирает и записывает в таблицу КаталогКниг
//
// Параметры:
//  нет
//
Процедура ЗаполнитьКаталогКниг() Экспорт
	
	АдресФайлаКаталогаКниг = Константы.АдресФайлаКаталогаКниг.Получить();
	
	ИмяВременногоФайлаАрхива = ОбщегоНазначения.ЗагрузитьФайлПоСсылке(АдресФайлаКаталогаКниг);
	
	ИмяВременногоФайлаКаталогаКниг = ПолучитьИмяВременногоФайла();
	АрхивКаталогаКниг = Новый ЧтениеZipФайла(ИмяВременногоФайлаАрхива);
	Попытка
		АрхивКаталогаКниг.ИзвлечьВсе(ИмяВременногоФайлаКаталогаКниг, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
	Исключение
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Не удалось распаковать каталог книг";
		СообщениеПользователю.Сообщить();
		ОписаниеОшибки = ОписаниеОшибки();
		ОбщегоНазначения.ЗафиксироватьОшибку(СообщениеПользователю.Текст, ОписаниеОшибки, Метаданные.РегистрыСведений.КаталогКниг, Неопределено);
		Возврат;
	КонецПопытки;
	АрхивКаталогаКниг.Закрыть();
	
	Файл = Новый Файл(ИмяВременногоФайлаКаталогаКниг);
	
	Если Не Файл.Существует() Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Не удалось распаковать каталог книг";
		СообщениеПользователю.Сообщить();
		ОбщегоНазначения.ЗафиксироватьОшибку(СообщениеПользователю.Текст, СообщениеПользователю.Текст, Метаданные.РегистрыСведений.КаталогКниг, Неопределено);
		Возврат;
	КонецЕсли;
	
	Если Файл.ЭтоКаталог() Тогда 
		МасивФайловКаталога = НайтиФайлы(ИмяВременногоФайлаКаталогаКниг, "*");
		Если МасивФайловКаталога.Количество() > 0 Тогда
			ИмяВременногоФайлаКаталогаКниг = МасивФайловКаталога[0].ПолноеИмя;
		КонецЕсли;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.КаталогКниг.СоздатьНаборЗаписей();
	
	КаталогКнигXML = Новый ЧтениеXML;
	КаталогКнигXML.ОткрытьФайл(ИмяВременногоФайлаКаталогаКниг);
	ТекущийУзел = Неопределено;
	
	ИдентификаторКниги = Неопределено;
	Наименование = Неопределено;
	Описание = Неопределено;
	Штрихкод = Неопределено;
	Автор = Неопределено;
	Издательство = Неопределено;
	ISBN = Неопределено;
	ГодИздания = Неопределено;
	СсылкаНаСайт = Неопределено;
	СсылкаНаКартинку = Неопределено;
	
	Пока КаталогКнигXML.Прочитать() Цикл
		
		Если КаталогКнигXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И КаталогКнигXML.Имя = "offer" Тогда
			Пока КаталогКнигXML.ПрочитатьАтрибут() Цикл
				Если КаталогКнигXML.ТипУзла = ТипУзлаXML.Атрибут И КаталогКнигXML.Имя = "id" Тогда
					ИдентификаторКниги = КаталогКнигXML.Значение;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если КаталогКнигXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И КаталогКнигXML.Имя = "url" Тогда 
			КаталогКнигXML.Прочитать();
			СсылкаНаСайт = КаталогКнигXML.Значение;
		КонецЕсли;
		
		Если КаталогКнигXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И КаталогКнигXML.Имя = "name" Тогда 
			КаталогКнигXML.Прочитать();
			Наименование = КаталогКнигXML.Значение;
		КонецЕсли;
		
		Если КаталогКнигXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И КаталогКнигXML.Имя = "description" Тогда 
			КаталогКнигXML.Прочитать();
			Описание = КаталогКнигXML.Значение;
		КонецЕсли;
		
		Если КаталогКнигXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И КаталогКнигXML.Имя = "barcode" Тогда 
			КаталогКнигXML.Прочитать();
			Штрихкод = КаталогКнигXML.Значение;
		КонецЕсли;
		
		Если КаталогКнигXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И КаталогКнигXML.Имя = "picture" Тогда 
			КаталогКнигXML.Прочитать();
			СсылкаНаКартинку = КаталогКнигXML.Значение;
		КонецЕсли;
		
		Если КаталогКнигXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И КаталогКнигXML.Имя = "author" Тогда 
			КаталогКнигXML.Прочитать();
			Автор = КаталогКнигXML.Значение;
		КонецЕсли;
		
		Если КаталогКнигXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И КаталогКнигXML.Имя = "publisher" Тогда 
			КаталогКнигXML.Прочитать();
			Издательство = КаталогКнигXML.Значение;
		КонецЕсли;
		
		Если КаталогКнигXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И КаталогКнигXML.Имя = "ISBN" Тогда 
			КаталогКнигXML.Прочитать();
			ISBN = КаталогКнигXML.Значение;
		КонецЕсли;
		
		Если КаталогКнигXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И КаталогКнигXML.Имя = "year" Тогда 
			КаталогКнигXML.Прочитать();
			ГодИздания = КаталогКнигXML.Значение;
		КонецЕсли;
		
		Если КаталогКнигXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И КаталогКнигXML.Имя = "param" Тогда 
			Пока КаталогКнигXML.ПрочитатьАтрибут() Цикл
				Если КаталогКнигXML.ТипУзла = ТипУзлаXML.Атрибут И КаталогКнигXML.Имя = "name" И КаталогКнигXML.Значение = "Автор" Тогда
					КаталогКнигXML.Прочитать();
					Автор = КаталогКнигXML.Значение;
				КонецЕсли;
				Если КаталогКнигXML.ТипУзла = ТипУзлаXML.Атрибут И КаталогКнигXML.Имя = "name" И КаталогКнигXML.Значение = "Публикации" Тогда
					КаталогКнигXML.Прочитать();
					Описание = КаталогКнигXML.Значение;
				КонецЕсли;
				Если КаталогКнигXML.ТипУзла = ТипУзлаXML.Атрибут И КаталогКнигXML.Имя = "name" И КаталогКнигXML.Значение = "Издательство" Тогда
					КаталогКнигXML.Прочитать();
					Издательство = КаталогКнигXML.Значение;
				КонецЕсли;
				Если КаталогКнигXML.ТипУзла = ТипУзлаXML.Атрибут И КаталогКнигXML.Имя = "name" И КаталогКнигXML.Значение = "ISBN" Тогда
					КаталогКнигXML.Прочитать();
					ISBN = КаталогКнигXML.Значение;
				КонецЕсли;
				Если КаталогКнигXML.ТипУзла = ТипУзлаXML.Атрибут И КаталогКнигXML.Имя = "name" И КаталогКнигXML.Значение = "Год выпуска" Тогда
					КаталогКнигXML.Прочитать();
					ГодИздания = КаталогКнигXML.Значение;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если КаталогКнигXML.ТипУзла = ТипУзлаXML.КонецЭлемента И КаталогКнигXML.Имя = "offer" Тогда
			
			НоваяКнигаКаталога = НаборЗаписей.Добавить();
			НоваяКнигаКаталога.ИдентификаторКниги = ИдентификаторКниги;
			НоваяКнигаКаталога.Наименование = Наименование;
			НоваяКнигаКаталога.Описание = Описание;
			НоваяКнигаКаталога.Штрихкод = Штрихкод;
			НоваяКнигаКаталога.Автор = Автор;
			НоваяКнигаКаталога.Издательство = Издательство;
			НоваяКнигаКаталога.ISBN = ISBN;
			НоваяКнигаКаталога.ISBNЧисло = СтрСоединить(СтрРазделить(Лев(ISBN, 13),"-",Ложь),"");
			НоваяКнигаКаталога.ГодИздания = ГодИздания;
			НоваяКнигаКаталога.СсылкаНаСайт = СтрЗаменить(СсылкаНаСайт, "prt_xml_facet", "ghostaz");
			НоваяКнигаКаталога.СсылкаНаКартинку = СсылкаНаКартинку;
			
			ИдентификаторКниги = Неопределено;
			Наименование = Неопределено;
			Описание = Неопределено;
			Штрихкод = Неопределено;
			Автор = Неопределено;
			Издательство = Неопределено;
			ISBN = Неопределено;
			ГодИздания = Неопределено;
			СсылкаНаСайт = Неопределено;
			СсылкаНаКартинку = Неопределено;
			
		КонецЕсли;
		
	КонецЦикла;
	НаборЗаписей.Записать(Истина);
	
	
КонецПроцедуры // ЗаполнитьКаталогКниг()

// Очищает регистр Каталог книг
//
// Параметры:
//  нет
//
Процедура ОчиститьКаталогКниг() Экспорт
	
	НаборЗаписей = РегистрыСведений.КаталогКниг.СоздатьНаборЗаписей();
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры // ОчиститьКаталогКниг()
